{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 128, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 10, "kernel_regularizer": null, "bias_constraint": null}}]}, "keras_version": "2.1.4", "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-07, "rho": 0.95, "decay": 0.0, "lr": 1.0}}, "metrics": ["accuracy"], "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 1, 32], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of2", "group3-shard2of2"], "weights": [{"shape": [9216, 128], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [128, 10], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [10], "dtype": "float32", "name": "dense_2/bias"}]}]}